{
  "id": 1125,
  "url": "www.dofactory.com/topic/1125/career-growth-plans.aspx",
  "title": ".NET career growth plan",
  "ques": "I am looking for some kind of a plan which I can follow to speed up my career growth in .NET. \r\nCurrently, i am working with ASP.NET MVC in a .NET Web Application. I have very good knowledge of C#, and ASP.NET.\r\n\r\nI had taken an interview where CLR was discussed in depth. Unfortunately, I was not able clear that interview.  Another instance was where SQL Server was discussed in great depth. Again I was not able to clear.\r\n\r\nSo, I guess there has to some kind of plan to follow to grow my .NET career, whether it be .NET, C#, .NET Framework, database or anything related to NET.\r\n\r\nAnyhow, any help would be appreciated.",
  "answers": [
    {
      "ansID": 1190,
      "ans": "I already answered but my session was gone when I tried to save my post. So here\u0027s a summary:\r\n\r\n\r\nLook at the different Microsoft Certifications you can do regarding Software Development, for example:\r\n070-536 (.NET 2.0 Basics)\r\n070-505 (.NET 3.5, WinForm)\r\n070-563 (.NET 3.5 Pro)\r\nMake use of the Microsoft Learning Center\r\nDownload and work through the Microsoft Training Kits (.NET 3.5, 4.0, Visual Studio 2010, Windows Phone 7, etc. pp.)\r\nRegister for and experiment with the MSDN Virtual Labs  Thats a fast summary of typical learning resources available for free from Microsoft that should help you to get into the right direction and deepen your Know How.\r\n\r\nRegards,\r\n- Chris."
    },
    {
      "ansID": 1192,
      "ans": "Christian has some great suggestions. Those are excellent ways of continuing your education and improving your skills and knowledge. Certifications will help immensely. I personally take a different approach. I don?t have any certifications; I rely solely on my experience. However, everyone has to start somewhere, and if you have no experience, then you need to get some. Practical experience will yield more knowledge than any book ever can. However that?s not to say books are not effect learning tools, because they very much are and I use them often. The wealth of knowledge available on the internet today should provide you with a solution to almost any development related problem.\r\n\r\nA good way to start would be to download several of the latest open source .Net projects, some of which can be found on the ASP.NET Web site if you?re planning to focus on Web application dev. Dig through the code and examine the methodologies used. Create a database diagram of the SQL data models in those projects to help understand the relationships between the tables. The DotNetNuke for example was instrumental in paving the way for new ASP.NET features and concepts. Microsoft applied some of the practices utilized in that open source project to the 2.0 release of ASP.NET. It was those DotNetNuke developers who paved the way for new ASP.NET features and if you understood the app well, you were already on the same page when 2.0 was released.\r\n\r\nAcquire a .Net hosting account from a provider and setup a Web space that you can practice with. Hosting is super cheap these days. Software development is a trade skill similar to welding or music. It requires you to hone your skills by practicing your craft. The more you practice, the more confidence you will gain and the stronger your skill set will become. Setup sandbox projects that allow you experiment with patterns and practices to understand concepts. Learning from existing projects will give you insight into what works and you may find yourself realizing that you can build a better mouse trap in the process.\r\n\r\nIf you can?t land a job yet, then take on smaller side projects from some of the work for hire Web sites out there that you can use for your portfolio. Most employers just want to know that you can do the job, and if you have no previous work experience under your belt, it?s going to be hard to convince them that you can in fact do the work.\r\nGood luck friend."
    }
  ]
}