{
  "id": 1134,
  "url": "www.dofactory.com/topic/1134/how-do-you-change-the-default-installation-folder-for-the-c-version-of-dp.aspx",
  "title": "Change the default installation folder for the C# version of DP Framework 4.0?",
  "ques": "I\u0027m trying to install the C# version of the 4.0  framework on my Windows XP workstation at work. It appears the msi file is configured to use the \u0027~My DocumentsDoFactory Pattern 4.0 CS\u0027 as the target installation folder. The My Documents folder on my workstation is mapped to a network drive which the DP Framework msi file is unable to access. I\u0027d like to install the framework into a different target folder but the msi app fails right away (due to the access problem mentioned above) and does not give me the option to change the target folder.\r\n\r\nHow do I remedy this?",
  "answers": [
    {
      "ansID": 1189,
      "ans": "First of all, I am sorry for the trouble.   \r\n\r\nJust so you know, the installation program does prompt you which folder to install.  However, it never reaches that point because apparently it tries to determine the space requirements and then generates an error if your My Documents folder has been mapped to a network share. We\u0027ve had a couple other users with similar problems.\r\n\r\nIn researching this, we discovered that even Microsoft Office installations experience the same problem.  \r\nTo the best of our knowledge, it seems to be related to some configuration on your machine. Either \r\n\r\n   1) how exactly the drive is mapped (with a drive letter as opposed to a UNC), or \r\n   2) an erroneous registry entry (possibly due to some past OS changes that were made) \r\n\r\nAs a work-around you could temporarily remove the mapping. Then run the installer and specify a local folder, say C:DPF 4.0 CS. However, your network people may not like this. \r\n\r\nHere is another way to get going: \r\n\r\nInstall on a standalone machine (at least a machine that does not have the My Documents mapping.   Then copy the entire folder DoFactory Patterns 4.0 CS to a location on your original machine. This is easy because all projects and documents reside under that folder. \r\n\r\nThe installation program creates 9 menu shortcuts which you will not have on your target machine. You can manually create these (or desktop shortcuts), or you can directly launch the documents and solutions by double clicking their names. \r\n\r\nUnfortunately, there is nothing we can do on our side, in terms of changing the install program, but hopefully this points you in the right direction. \r\n"
    }
  ]
}